import React,{ useCallback } from 'react';
import { useHistory } from 'react-router-dom';

import { LibraryWrap } from './StyledLibrary'

const Library = () => {
   let history = useHistory()
   const handleClick = useCallback(() => {
      return () => {
         history.push('/home/onlinedet')
      }
   })

  return (
    <>
      <LibraryWrap>
        <div className="container">
          <h1>
            <span>图书馆</span>
          </h1>

          <ul>
            <li>
              <img src="/img/library.png"  onClick={handleClick()} alt=""/>
              <h3 onClick={handleClick()} >上海图书馆</h3>
              <p>
                                上海图书馆位于上海市徐汇区淮海中路，是上海市综合性研究
型公共图书馆和行业情报中心，也是全国文化信息资源共享工
程上海市分中心、文化部公共文化研究基地，是首批国家重点
古籍保护单位。 上海图书馆创立于1952年，上海科学技术情
报研究所成立于1958年，1995年上海图书馆与上海科学技术
情报研究所合并，1996年12月上海图书馆新馆正式对外开放。 
                            </p>
            </li>
            <li>
              <img src="/img/library.png" alt=""/>
              <h3>上海图书馆</h3>
              <p>
                                上海图书馆位于上海市徐汇区淮海中路，是上海市综合性研究
型公共图书馆和行业情报中心，也是全国文化信息资源共享工
程上海市分中心、文化部公共文化研究基地，是首批国家重点
古籍保护单位。 上海图书馆创立于1952年，上海科学技术情
报研究所成立于1958年，1995年上海图书馆与上海科学技术
情报研究所合并，1996年12月上海图书馆新馆正式对外开放。 
                            </p>
            </li>
            <li>
              <img src="/img/library.png" alt=""/>
              <h3>上海图书馆</h3>
              <p>
                                上海图书馆位于上海市徐汇区淮海中路，是上海市综合性研究
型公共图书馆和行业情报中心，也是全国文化信息资源共享工
程上海市分中心、文化部公共文化研究基地，是首批国家重点
古籍保护单位。 上海图书馆创立于1952年，上海科学技术情
报研究所成立于1958年，1995年上海图书馆与上海科学技术
情报研究所合并，1996年12月上海图书馆新馆正式对外开放。 
                            </p>
            </li>
            <li>
              <img src="/img/library.png" alt=""/>
              <h3>上海图书馆</h3>
              <p>
                                上海图书馆位于上海市徐汇区淮海中路，是上海市综合性研究
型公共图书馆和行业情报中心，也是全国文化信息资源共享工
程上海市分中心、文化部公共文化研究基地，是首批国家重点
古籍保护单位。 上海图书馆创立于1952年，上海科学技术情
报研究所成立于1958年，1995年上海图书馆与上海科学技术
情报研究所合并，1996年12月上海图书馆新馆正式对外开放。 
                            </p>
            </li>
            <li>
              <img src="/img/library.png" alt=""/>
              <h3>上海图书馆</h3>
              <p>
                                上海图书馆位于上海市徐汇区淮海中路，是上海市综合性研究
型公共图书馆和行业情报中心，也是全国文化信息资源共享工
程上海市分中心、文化部公共文化研究基地，是首批国家重点
古籍保护单位。 上海图书馆创立于1952年，上海科学技术情
报研究所成立于1958年，1995年上海图书馆与上海科学技术
情报研究所合并，1996年12月上海图书馆新馆正式对外开放。 
                            </p>
            </li>
            <li>
              <img src="/img/library.png" alt=""/>
              <h3>上海图书馆</h3>
              <p>
                                上海图书馆位于上海市徐汇区淮海中路，是上海市综合性研究
型公共图书馆和行业情报中心，也是全国文化信息资源共享工
程上海市分中心、文化部公共文化研究基地，是首批国家重点
古籍保护单位。 上海图书馆创立于1952年，上海科学技术情
报研究所成立于1958年，1995年上海图书馆与上海科学技术
情报研究所合并，1996年12月上海图书馆新馆正式对外开放。 
                            </p>
            </li>
          </ul>
        </div>
      </LibraryWrap>
    </>
  );
}

export default Library;
 